public class ComplexFormattingExample {
    public static void main(String[] args) {

        int a = 203040;
        double b = 104050.2030;
        String c = "Привіт ";
        boolean d = true;
        System.out.format("Ціле число: %10d | Плаваюче число з крапкою: %02f | Строка: %2s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %-15d| Плаваюче число з крапкою: %05f | Строка: %-5s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %20d| Плаваюче число з крапкою: %.3f | Строка: %15s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %10d %n | Плаваюче число з крапкою: %02f %n | Строка: %2s %n | Логічне значення: %b %n", a,b,c,d);
        System.out.format("Ціле число: %,d  %n | Плаваюче число з крапкою: %02f | Строка: %2s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %10d | Плаваюче число з крапкою: %02f | Строка: %20s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %10d | Плаваюче число з крапкою: %02e | Строка: %2s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %10x | Плаваюче число з крапкою: %02f | Строка: %2s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %10d | Плаваюче число з крапкою: %,.2f | Строка: %2s | Логічне значення: %b%n", a,b,c,d);
        System.out.format("Ціле число: %10d | Плаваюче число з крапкою: %02f | Строка: %.3s | Логічне значення: %b%n", a,b,c,d);
    }
}